Revit 2024 API
ThermalAsset.ThermalConductivity Property
 The thermal conductivity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double ThermalConductivity { get; set; }
Visual Basic
Public Property ThermalConductivity As Double
	Get
	Set
Visual C++
public:
property double ThermalConductivity {
	double get ();
	void set (double value);
}
Remarks
 Values are in feet-kilograms per Kelvin-cubed-second ((ft · kg)/(K · s³)) and must be non-negative.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for thermalConductivity must be non-negative.
See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace